verification/runs/F3_runs/cone/M3.0_th12/medium/0/U
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (3.0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    farfield
    {
        type            zeroGradient;
    }
    cone
    {
        type            slip;
    }
    frontWedge
    {
        type            wedge;
    }
    backWedge
    {
        type            wedge;
    }
}
